---
kind: property
id: P:Autodesk.Revit.DB.ReloadSwapOutInfo.Part
source: html/6a983706-1810-c7b2-5c33-800b2ff51562.htm
---
# Autodesk.Revit.DB.ReloadSwapOutInfo.Part Property

The ElementId of part being swapped.

## Syntax (C#)
```csharp
public ElementId Part { get; }
```